КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ОсобыеУсловияПеревозки/КонтурЛогистика_ОсобыеУсловияПеревозки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ОсобыеУсловияПеревозки</name>
  <attributes>
    <name>СрокДостГр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УкНормПрвз</name>
    <comment>Указания в отношении выполнения норм перевозки (для выполнения фитосанитарных, санитарных, карантинных, таможенных и прочих требований, установленных законодательством Российской Федерации)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОгрСкор</name>
    <comment>Указания об ограничениях скорости движения при перевозке груза</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отмет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемпНеНиже</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемпНеВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажнНеНиже</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажнНеВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ОсобыеУсловияПеревозки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция НайтиСоздатьПоОбъектуXDTO(ОбъектXDTO) Экспорт
	
	Если ОбъектXDTO = Неопределено Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	СтруктураПараметров = Новый Структура("СрокДостГр, УкНормПрвз, ОгрСкор, Отмет, ТемпНеНиже, ТемпНеВыше, ВлажнНеНиже, ВлажнНеВыше");
	
    СтруктураПараметров.СрокДостГр = КС.XDTO_ВычислитьЧисло(ОбъектXDTO, "СрокДостГр");
	СтруктураПараметров.УкНормПрвз = КС.XDTO_Вычислить(ОбъектXDTO, "УкНормПрвз", "");
	СтруктураПараметров.ОгрСкор = КС.XDTO_Вычислить(ОбъектXDTO, "ОгрСкор", "");
	СтруктураПараметров.Отмет = КС.XDTO_Вычислить(ОбъектXDTO, "Отмет", "");
	
	КлимРеж = КС.XDTO_Вычислить(ОбъектXDTO, "КлимРеж");
	СтруктураПараметров.ТемпНеНиже = КС.XDTO_ВычислитьЧисло(КлимРеж, "ТемпНеНиже");
	СтруктураПараметров.ТемпНеВыше = КС.XDTO_ВычислитьЧисло(КлимРеж, "ТемпНеВыше");
	СтруктураПараметров.ВлажнНеНиже = КС.XDTO_ВычислитьЧисло(КлимРеж, "ВлажнНеНиже");
	СтруктураПараметров.ВлажнНеВыше = КС.XDTO_ВычислитьЧисло(КлимРеж, "ВлажнНеВыше");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
				   |	КонтурЛогистика_ОсобыеУсловияПеревозки.Ссылка КАК Ссылка
				   |ИЗ
				   |	Справочник.КонтурЛогистика_ОсобыеУсловияПеревозки КАК КонтурЛогистика_ОсобыеУсловияПеревозки
				   |ГДЕ
				   |	КонтурЛогистика_ОсобыеУсловияПеревозки.ПометкаУдаления = ЛОЖЬ
				   |	И КонтурЛогистика_ОсобыеУсловияПеревозки.СрокДостГр = &СрокДостГр
				   |	И КонтурЛогистика_ОсобыеУсловияПеревозки.УкНормПрвз = &УкНормПрвз
				   |	И КонтурЛогистика_ОсобыеУсловияПеревозки.ОгрСкор = &ОгрСкор
				   |	И КонтурЛогистика_ОсобыеУсловияПеревозки.Отмет = &Отмет
				   |	И КонтурЛогистика_ОсобыеУсловияПеревозки.ТемпНеНиже = &ТемпНеНиже
				   |	И КонтурЛогистика_ОсобыеУсловияПеревозки.ТемпНеВыше = &ТемпНеВыше
				   |	И КонтурЛогистика_ОсобыеУсловияПеревозки.ВлажнНеНиже = &ВлажнНеНиже
				   |	И КонтурЛогистика_ОсобыеУсловияПеревозки.ВлажнНеВыше = &ВлажнНеВыше";
	
	Для Каждого ПараметрЗапроса Из СтруктураПараметров Цикл 
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;   

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда 
		
		Результат = Выборка.Ссылка;
		
	Иначе 
		Условие = СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Условие, СтруктураПараметров);
		Условие.СформироватьНаименование();	
		Условие.Записать();
		Результат = Условие.Ссылка; 
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

#КонецЕсли
